БИТУправление_медицинским_центром_демо/src/DataProcessors/invАРМПС2/invАРМПС2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>invАРМПС2</name>
  <tabularSections>
    <name>Option</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BiomaterialId</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/Catalogs/invПродукт/invПродукт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>invПродукт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КодПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоВСоставеПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>EnumRef.invТипПродукта</types>
    </type>
  </attributes>
  <attributes>
    <name>URLОписанияПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Преаналитика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыборБМ</name>
    <attributes>
      <name>ВариантВыбораБМ</name>
      <type>
        <types>CatalogRef.invВыборБМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/DataProcessors/invАРМПС2/Forms/ФормаКаталогПродуктов/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВЗаказ(Команда)
	АдресХранилища = ПоместитьВоВременноеХранилище(ВыбранныеПродукты);
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		Закрыть(АдресХранилища);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ВыбранныеПродукты.Очистить();
	Элементы.Декорация1.Заголовок = "Выбрано  " + Строка(ВыбранныеПродукты.Количество()) + "  тестов";
	КатегорииПриАктивизацииСтроки(Элементы.Категории);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продукт.Ссылка
	|ИЗ
	|	Справочник.invПродукт КАК Продукт
	|ГДЕ
	|	Продукт.Родитель = &Родитель
	|	И Продукт.ЭтоГруппа = ИСТИНА";
	
	
	Запрос.УстановитьПараметр("Родитель", Справочники.invПродукт.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Для Каждого Категория Из РезультатЗапроса Цикл
		стр = Категории.Добавить();
		стр.Категория = Категория;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КатегорииПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Элементы.ДеревоПродуктов.Обновить();
		ДП = КатегорииПриАктивизацииСтрокиНаСервере(Элемент.ТекущиеДанные.Категория);
		ЭлементыДерева = ДеревоПродуктов.ПолучитьЭлементы();
		ЭлементыДерева.Очистить();
		Для Каждого элтДП Из ДП Цикл
			Если элтДП <> Неопределено Тогда
			ЭлтДерева =	ЭлементыДерева.Добавить();
			ЭлтДерева.ЭтоГруппа = элтДП.ЭтоГруппа;
			ЭлтДерева.КодПродукта1 = элтДП.КодПродукта1;
			Если элтДП.Строки.Количество() > 0 Тогда
				ЭлтыДереваД = ЭлтДерева.ПолучитьЭлементы();
				//ЭлтДереваД = ЭлтыДереваД.Добавить();
				Для Каждого пр Из элтДП.Строки Цикл
					ЭлтДереваД = ЭлтыДереваД.Добавить();
					НайденноеЗначение = "";
					Если пр.Свойство("КодПродукта1",НайденноеЗначение) Тогда
						ЭлтДереваД.КодПродукта1  = НайденноеЗначение;
						ЭлтДереваД.Продукт1      = пр.Продукт1;
						Если ВыбранныеПродукты.НайтиПоЗначению(ЭлтДереваД.Продукт1) <> Неопределено Тогда
							 ЭлтДереваД.Выбор1 = Истина;
						КонецЕсли;
					ИначеЕсли пр.Свойство("КодПродукта2",НайденноеЗначение) Тогда
						ЭлтДереваД.КодПродукта2  = НайденноеЗначение;
						ЭлтДереваД.Продукт2      = пр.Продукт2;
						Если ВыбранныеПродукты.НайтиПоЗначению(ЭлтДереваД.Продукт2) <> Неопределено Тогда
							 ЭлтДереваД.Выбор2 = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Элементы.ДеревоПродуктов.Обновить();
		Развернуть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КатегорииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПродуктовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Если Поле.Имя = "Продукт1" ИЛИ Поле.Имя = "Продукт2" Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		ДеревоПродуктовВыборНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выбор1ПриИзменении(Элемент)
	Если Элемент.Родитель.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.Родитель.ТекущиеДанные.Выбор1 Тогда
			Если ВыбранныеПродукты.НайтиПоЗначению(Элемент.Родитель.ТекущиеДанные.Продукт1) = Неопределено Тогда
				//ВыбранныеПродукты.Добавить(Элемент.Родитель.ТекущиеДанные.Продукт1);
				ТолькоВСоставеПрофиля = ПроверитьПродуктСервер(Элемент.Родитель.ТекущиеДанные.Продукт1);
				Если ТолькоВСоставеПрофиля Тогда
					ПоказатьОповещениеПользователя("Выбранный продукт - " + Строка(Элемент.Родитель.ТекущиеДанные.Продукт1) + " - можно заказать только в составе профиля!",,"Данный продукт НЕ будет добавлен в текущую заявку!");	
				Иначе
					ВыбранныеПродукты.Добавить(Элемент.Родитель.ТекущиеДанные.Продукт1);
					Элементы.Декорация1.Заголовок = "Выбрано  " + Строка(ВыбранныеПродукты.Количество()) + "  тестов";
					ПоказатьОповещениеПользователя("Выбран продукт - " + Строка(Элемент.Родитель.ТекущиеДанные.Продукт1),ПН(Элемент.Родитель.ТекущиеДанные.Продукт1),"Данный продукт будет добавлен в текущую заявку!");
				КонецЕсли;
			КонецЕсли;
		Иначе
			выбранныйпродукт = ВыбранныеПродукты.НайтиПоЗначению(Элемент.Родитель.ТекущиеДанные.Продукт1);
			ВыбранныеПродукты.Удалить(выбранныйпродукт);
			Элементы.Декорация1.Заголовок = "Выбрано  " + Строка(ВыбранныеПродукты.Количество()) + "  тестов";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выбор2ПриИзменении(Элемент)
	Если Элемент.Родитель.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.Родитель.ТекущиеДанные.Выбор2 Тогда
			Если ВыбранныеПродукты.НайтиПоЗначению(Элемент.Родитель.ТекущиеДанные.Продукт2) = Неопределено Тогда
				ТолькоВСоставеПрофиля = ПроверитьПродуктСервер(Элемент.Родитель.ТекущиеДанные.Продукт2);
				Если ТолькоВСоставеПрофиля Тогда
					ПоказатьОповещениеПользователя("Выбранный продукт - " + Строка(Элемент.Родитель.ТекущиеДанные.Продукт2) + " - можно заказать только в составе профиля!",,"Данный продукт НЕ будет добавлен в текущую заявку!");	
				Иначе
					ВыбранныеПродукты.Добавить(Элемент.Родитель.ТекущиеДанные.Продукт2);
					Элементы.Декорация1.Заголовок = "Выбрано  " + Строка(ВыбранныеПродукты.Количество()) + "  тестов";
					ПоказатьОповещениеПользователя("Выбран продукт - " + Строка(Элемент.Родитель.ТекущиеДанные.Продукт2),ПН(Элемент.Родитель.ТекущиеДанные.Продукт2),"Данный продукт будет добавлен в текущую заявку!");
				КонецЕсли;
			КонецЕсли;
		Иначе
			выбранныйпродукт = ВыбранныеПродукты.НайтиПоЗначению(Элемент.Родитель.ТекущиеДанные.Продукт2);
			ВыбранныеПродукты.Удалить(выбранныйпродукт);
			Элементы.Декорация1.Заголовок = "Выбрано  " + Строка(ВыбранныеПродукты.Количество()) + "  тестов";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродуктОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТолькоВСоставеПрофиля = ПроверитьПродуктСервер(ВыбранноеЗначение);
	Если ТолькоВСоставеПрофиля Тогда
		ПоказатьОповещениеПользователя("Выбранный продукт - " + Строка(ВыбранноеЗначение) + " - можно заказать только в составе профиля!",,"Данный продукт НЕ будет добавлен в текущую заявку!");
	Иначе
		ВыбранныеПродукты.Добавить(ВыбранноеЗначение);
		Элементы.Декорация1.Заголовок = "Выбрано  " + Строка(ВыбранныеПродукты.Количество()) + "  тестов";
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура Развернуть()
	
	КоллекцияДерева = ДеревоПродуктов.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из КоллекцияДерева Цикл
		Индекс = СтрокаДерева.ПолучитьИдентификатор();
		Элементы.ДеревоПродуктов.Развернуть(Индекс);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КатегорииПриАктивизацииСтрокиНаСервере(КатегорияПродуктов)
	мсв = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продукт.КодПродукта КАК КодПродукта,
	|	Продукт.Ссылка КАК Продукт,
	|	Продукт.Родитель.Наименование КАК Вид,
	|	ВЫРАЗИТЬ(Продукт.ПолноеНаименование КАК СТРОКА(250)) КАК ПН
	|ИЗ
	|	Справочник.invПродукт КАК Продукт
	|ГДЕ
	|	Продукт.Родитель.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вид,
	|	КодПродукта,
	|	ПН
	|ИТОГИ ПО
	|	Вид";
	
	Запрос.УстановитьПараметр("Родитель", КатегорияПродуктов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВид = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ДеревоПродуктовСервер = ДанныеФормыВЗначение(ДеревоПродуктов,тип("ДеревоЗначений"));
	//ДП.Строки.Очистить();
	Пока ВыборкаВид.Следующий() Цикл
		//СтрокаГруппы = ДП.Строки.Добавить();
		ДП = Новый Структура;
		ДП.Вставить("ЭтоГруппа",Истина);
		ДП.Вставить("КодПродукта1",ВыборкаВид.Вид);	
		ВыборкаДетальныеЗаписи = ВыборкаВид.Выбрать();
		Итератор = 1;
		мсвДетальные = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//мсвДетальные = Новый Массив;
			ДПДетальные = Новый Структура;
			Если Итератор = 1 Тогда
				//СтрокаТестов = СтрокаГруппы.Строки.Добавить();
				ДПДетальные.Вставить("КодПродукта1",ВыборкаДетальныеЗаписи.КодПродукта);
				ДПДетальные.Вставить("Продукт1",ВыборкаДетальныеЗаписи.Продукт);
				Итератор = Итератор + 1;
			ИначеЕсли Итератор = 2 Тогда
				ДПДетальные.Вставить("КодПродукта2",ВыборкаДетальныеЗаписи.КодПродукта);
				ДПДетальные.Вставить("Продукт2",ВыборкаДетальныеЗаписи.Продукт);
				Итератор = 1;
			КонецЕсли;
			мсвДетальные.Добавить(ДПДетальные);
			ДП.Вставить("Строки",мсвДетальные);
		КонецЦикла;
		//ДП.Вставить("Строки",мсвДетальные);
		мсв.Добавить(ДП);
	КонецЦикла;
	//мсв.Добавить(ДП);
	Возврат	  мсв
КонецФункции

&НаСервере
Процедура ДеревоПродуктовВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПН(Ссылка)
	Возврат Ссылка.ПолноеНаименование
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьПродуктСервер(Ссылка)
	Возврат ?(Ссылка.ТолькоВСоставеПрофиля,Истина,Ложь)
КонецФункции

#КонецОбласти
